/*
 * Copyright (c) 2021 Ubique Innovation AG <https://www.ubique.ch>
 *
 *  This Source Code Form is subject to the terms of the Mozilla Public
 *  License, v. 2.0. If a copy of the MPL was not distributed with this
 *  file, You can obtain one at https://mozilla.org/MPL/2.0/.
 *
 *  SPDX-License-Identifier: MPL-2.0
 */

#include "ColorLineGroup2dShaderOpenGl.h"
#include "OpenGlContext.h"
#include "OpenGlHelper.h"
#include <cassert>
#include <cstring>

ColorLineGroup2dShaderOpenGl::ColorLineGroup2dShaderOpenGl(bool projectOntoUnitSphere, bool simple)
        : projectOntoUnitSphere(projectOntoUnitSphere),
          isSimpleLine(simple),
          sizeLineValues(simple ? sizeSimpleLineValues : sizeFullLineValues),
          sizeLineValuesArray((simple ? sizeSimpleLineValues : sizeFullLineValues) * MAX_NUM_STYLES),
          programName(simple ? (projectOntoUnitSphere
                                ? "UBMAP_ColorSimpleLineGroupUnitSphereShaderOpenGl"
                                : "UBMAP_ColorSimpleLineGroupShaderOpenGl") : projectOntoUnitSphere
                                                                              ? "UBMAP_ColorLineGroupUnitSphereShaderOpenGl"
                                                                              : "UBMAP_ColorLineGroupShaderOpenGl") {
    lineValues.resize(sizeLineValuesArray);
}

std::shared_ptr<ShaderProgramInterface> ColorLineGroup2dShaderOpenGl::asShaderProgramInterface() { return shared_from_this(); }


        glBufferData(GL_UNIFORM_BUFFER, sizeLineValuesArray * sizeof(GLfloat) + sizeof(GLint) + 3 * sizeof(GLint), nullptr,
                     GL_DYNAMIC_DRAW);
        glBindBuffer(GL_UNIFORM_BUFFER, 0);
    }

    int program = context->getProgram(programName);
    dashingScaleFactorHandle = glGetUniformLocation(program, "dashingScaleFactor");
    timeFrameDeltaHandle = glGetUniformLocation(program, "timeFrameDeltaSeconds");
}

void ColorLineGroup2dShaderOpenGl::clearGlObjects() {
    if (lineStyleBuffer > 0) {
        std::lock_guard<std::recursive_mutex> lock(styleMutex);
        lineStyleBuffer = 0;
        stylesUpdated = true;
        glDeleteBuffers(1, &lineStyleBuffer);
    }
    dashingScaleFactorHandle = -1;
    timeFrameDeltaHandle = -1;
}

void ColorLineGroup2dShaderOpenGl::preRender(const std::shared_ptr<::RenderingContextInterface> &context) {
    BaseShaderProgramOpenGl::preRender(context);

    glBindBufferBase(GL_UNIFORM_BUFFER, 0, lineStyleBuffer); // LineStyleCollection is at binding index 0

    {
        std::lock_guard<std::recursive_mutex> lock(styleMutex);
        if (numStyles == 0) {
            return;
        }

        if (dashingScaleFactorHandle >= 0) {
            glUniform1f(dashingScaleFactorHandle, dashingScaleFactor);
        }
        if (timeFrameDeltaHandle >= 0) {
            std::shared_ptr<OpenGlContext> openGlContext = std::static_pointer_cast<OpenGlContext>(context);
            glUniform1f(timeFrameDeltaHandle, (float) openGlContext->getDeltaTimeMs() / 1000.0f);
        }

        if (stylesUpdated) {
            stylesUpdated = false;
            glBindBuffer(GL_UNIFORM_BUFFER, lineStyleBuffer);
            glBufferSubData(GL_UNIFORM_BUFFER, 0, numStyles * sizeLineValues * sizeof(GLfloat), &lineValues[0]);
            glBufferSubData(GL_UNIFORM_BUFFER, MAX_NUM_STYLES * sizeLineValues * sizeof(GLfloat), sizeof(GLint), &numStyles);
            glBindBuffer(GL_UNIFORM_BUFFER, 0);
        }
    }
}

bool ColorLineGroup2dShaderOpenGl::isRenderable() {
    std::lock_guard<std::recursive_mutex> overlayLock(styleMutex);
    return numStyles > 0;
}

void ColorLineGroup2dShaderOpenGl::setStyles(const ::SharedBytes & styles) {
    assert(styles.elementCount <= MAX_NUM_STYLES);
    assert(styles.elementCount * styles.bytesPerElement <= lineValues.size() * sizeof(float));
    {
        std::lock_guard<std::recursive_mutex> overlayLock(styleMutex);
        if(styles.elementCount > 0) {
            std::memcpy(lineValues.data(), (void *)styles.address, styles.elementCount * styles.bytesPerElement);
        }

        numStyles = styles.elementCount;
        stylesUpdated = true;
    }
}

void ColorLineGroup2dShaderOpenGl::setDashingScaleFactor(float factor) {
    {
        std::lock_guard<std::recursive_mutex> overlayLock(styleMutex);
        this->dashingScaleFactor = factor;
    }
}

std::string ColorLineGroup2dShaderOpenGl::getLineStylesUBODefinition(bool isSimpleLine) {
    if (isSimpleLine) {
        return OMMShaderCode(
                struct SimpleLineStyle {
                    float width; // 0
                    float colorR; // 1
                    float colorG; // 2
                    float colorB; // 3
                    float colorA; // 4
                    float widthAsPixels; // 5
                    float opacity; // 6
                    float capType; // 7
                };

                layout (std140) uniform LineStyleCollection {
                    SimpleLineStyle lineValues[) + std::to_string(MAX_NUM_STYLES) + OMMShaderCode(];
                    lowp int numStyles;
                } uLineStyles;
        );
    } else {
        return OMMShaderCode(
                struct LineStyle {
                    float width; // 0
                    float colorR; // 1
                    float colorG; // 2
                    float colorB; // 3
                    float colorA; // 4
                    float gapColorR; // 5
                    float gapColorG; // 6
                    float gapColorB; // 7
                    float gapColorA; // 8
                    float widthAsPixels; // 9
                    float opacity; // 10
                    float blur; // 11
                    float capType; // 12
                    float numDashValues; // 13
                    float dashArray0; // 14
                    float dashArray1; // 15
                    float dashArray2; // 16
                    float dashArray3; // 17
                    float dashFade; // 18
                    float dashAnimationSpeed; // 19
                    float offset; // 20
                    float dotted; // 21
                    float dottedSkew; // 22
                };

                layout (std140) uniform LineStyleCollection {
                    LineStyle lineValues[) + std::to_string(MAX_NUM_STYLES) + OMMShaderCode(];
                    lowp int numStyles;
                } uLineStyles;
        );
    }
}

std::string ColorLineGroup2dShaderOpenGl::getVertexShader() {
    if (isSimpleLine) {
        return OMMVersionedGlesShaderCode(320 es,
                                          precision highp float;
                                                  uniform mat4 umMatrix;
                                                  uniform mat4 uvpMatrix;
                                                  uniform vec4 uOriginOffset;
               ) + (projectOntoUnitSphere ?
                   OMMShaderCode(
                           uniform vec4 uLineOrigin;
                           in vec3 vPointA;
                           in vec3 vPointB;
                   ) : OMMShaderCode(
